### Practice Excercise

**Objective:**
Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.
**Perform the following tasks:**
1. Create a new table named `Books`, with the following columns:
  * BookID (Primary Key, Auto-increment)
  * Title (Title of the book)
  * Author (Author of the book)
  * Genre (Genre of the book)
  * Publication_Year (Year of publication)
  * Price (Price of the Book)
2. Insert at least 3 new books into the `Books` table.
3. Retrieve all books from the Books table.
4. Update the price of a specific book.
5. Delete a book from the table.

In [2]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: decorator in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (3.0.46)
Requirement already satisfied: pygments>=2.4.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\admin\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\admin\appdata\roaming\python\python312\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\admin\appdata\roaming\python\python312\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\admin\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///sql-database.db

In [14]:
%%sql
CREATE TABLE IF NOT EXISTS Books (
    BookId INT Primary Key Not Null,
    Title VARCHAR(255) Not Null,
    Author VARCHAR(255) Not Null,
    Genre VARCHAR(100) Not Null,
    Publication_Year INT Not Null,
    Price FLOAT(10,2) Not Null
);

 * sqlite:///sql-database.db
Done.

[]

In [43]:
%%sql
SELECT name FROM sqlite_master WHERE type='Books';

 * sqlite:///sql-database.db
Done.

[]

In [15]:
%%sql
PRAGMA table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 1, None, 0),
 (4, 'Pulication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]

In [19]:
%sql DROP TABLE Books;

 * sqlite:///sql-database.db
Done.

[]

In [20]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sql-database.db
Done.

[]

In [21]:
%%sql
PRAGMA table_info('Books');

 * sqlite:///sql-database.db
Done.

[]

In [52]:
%%sql
Create table Books (
    BookID INT Primary Key Not Null,
    Title VARCHAR(255) Not Null,
    Author VARCHAR(255) Not Null,
    Genre VARCHAR(50) Not Null,
    Pulication_Year INT Not Null,
    Price FLOAT(10,2) Not Null
)

 * sqlite:///sql-database.db
(sqlite3.OperationalError) table Books already exists
[SQL: Create table Books (
    BookID INT Primary Key Not Null,
    Title VARCHAR(255) Not Null,
    Author VARCHAR(255) Not Null,
    Genre VARCHAR(50) Not Null,
    Pulication_Year INT Not Null,
    Price FLOAT(10,2) Not Null
)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [53]:
%%sql
SELECT name FROM sqlite_master WHERE type='Books';

 * sqlite:///sql-database.db
Done.

[]

In [54]:
%%sql
PRAGMA table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 1, None, 0),
 (4, 'Pulication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]

In [16]:
%sql DROP TABLE Books;

 * sqlite:///sql-database.db
Done.

[]

In [17]:
%%sql
SELECT name FROM sqlite_master WHERE type='Books';

 * sqlite:///sql-database.db
Done.

[]

In [18]:
%%sql
PRAGMA table_info('Books');

 * sqlite:///sql-database.db
Done.

[]

In [19]:
%%sql
Create table Books (
    BookID INT Primary Key Not Null,
    Title VARCHAR(255) Not Null,
    Author VARCHAR(255) Not Null,
    Genre VARCHAR(50) Not Null,
    Publication_Year INT Not Null,
    Price FLOAT(10,2) Not Null
)

 * sqlite:///sql-database.db
Done.

[]

In [20]:
%%sql
Select name from sqlite_master where type = 'Books';

 * sqlite:///sql-database.db
Done.

[]

In [21]:
%%sql
Pragma table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 1, None, 0),
 (4, 'Publication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]

In [54]:
%%sql
INSERT INTO Books (BookID, Title, Author, Genre, Publication_Year, Price)
VALUES (1, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.00),
       (2, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
       (3, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75);

 * sqlite:///sql-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Books.BookID
[SQL: INSERT INTO Books (BookID, Title, Author, Genre, Publication_Year, Price)
VALUES (1, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.00),
       (2, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
       (3, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [56]:
%%sql
SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(100, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (1, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (2, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (3, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75),
 (11, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (12, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (13, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75),
 (111, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (112, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (113, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75),
 (101, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (102, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (103, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75)]

In [58]:
%%sql
DELETE FROM Books WHERE BookID = 100;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [60]:
%%sql
DELETE FROM Books WHERE BookID IN (1, 2, 3);

 * sqlite:///sql-database.db
3 rows affected.

[]

In [61]:
%%sql
SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(11, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (12, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (13, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75),
 (111, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (112, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (113, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75),
 (101, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (102, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (103, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75)]

In [63]:
%%sql
DELETE FROM Books WHERE BookID IN (11, 12, 13, 111, 112, 113);

 * sqlite:///sql-database.db
6 rows affected.

[]

In [64]:
%%sql
SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(101, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 100.0),
 (102, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (103, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75)]

In [65]:
%%sql
UPDATE Books SET Price = 199.75 WHERE BookID = 101;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [66]:
%%sql
SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(101, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 199.75),
 (102, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75),
 (103, 'Ipon is Life', 'Chinkee Tan', 'Non-Fiction', 2019, 99.75)]

In [67]:
%%sql
DELETE FROM Books WHERE BookID = 103;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [68]:
%%sql
SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(101, 'Diary ng Pulubi', 'Chinkee Tan', 'Non-Fiction', 2023, 199.75),
 (102, 'Good Morning, Lord', 'Charles Swindoll', 'Religious', 2018, 499.75)]

In [5]:
%%sql
Pragma table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 1, None, 0),
 (4, 'Publication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]

In [6]:
%%sql
ALTER TABLE Books RENAME COLUMN Genre to Genra;

 * sqlite:///sql-database.db
Done.

[]

In [7]:
%%sql
Pragma table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genra', 'VARCHAR(50)', 1, None, 0),
 (4, 'Publication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]

In [8]:
%%sql
ALTER TABLE Books RENAME COLUMN Genra to Genre;

 * sqlite:///sql-database.db
Done.

[]

In [9]:
%%sql
Pragma table_info('Books');

 * sqlite:///sql-database.db
Done.

[(0, 'BookID', 'INT', 1, None, 1),
 (1, 'Title', 'VARCHAR(255)', 1, None, 0),
 (2, 'Author', 'VARCHAR(255)', 1, None, 0),
 (3, 'Genre', 'VARCHAR(50)', 1, None, 0),
 (4, 'Publication_Year', 'INT', 1, None, 0),
 (5, 'Price', 'FLOAT(10,2)', 1, None, 0)]